Q1. List any five functions of the pandas library with execution.

In [16]:
import pandas as pd

To Read the coma seperated file

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

 Checking data types of each column

In [5]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [3]:
df.rename(columns={'PassengerId':'Passenger_id', 'Pclass':'P_class'}, inplace = True)

In [4]:
df.head()

,Passenger_id,Survived,P_class,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df.describe()

,Passenger_id,Survived,P_class,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [4]:
def reindex_with_increment(df):
    new_index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)
    
    df = df.reset_index(drop= True)
    df.index = new_index
    
    return df

In [5]:
data = {'A': [10,20,30], 'B': [40,50,60], 'c':[70,80,90]}
df = pd.DataFrame(data)

In [6]:
df

    A   B   c
0  10  40  70
1  20  50  80
2  30  60  90

In [7]:
df = reindex_with_increment(df)

In [8]:
df

    A   B   c
1  10  40  70
3  20  50  80
5  30  60  90

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [9]:
def cal_sum_first_three(df):
    if 'Values' in df.columns:
        first_three_val = df['Values'].iloc[:3]
        total_sum = first_three_val.sum()
        print('sum_of_first_three_values : ',total_sum)
    else:
        print('DataFrame does not have a "Values" column')

In [7]:
df1 = pd.DataFrame({'alphabets':['a','b','c','d','e'],'Values':[10,20,30,40,50]})

In [10]:
cal_sum_first_three(df1)

sum_of_first_three_values :  60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [11]:
def len_character(df):
    if 'Text' in df.columns:
        df['character_count'] = df['Text'].str.len()
        return df
    else:
        print('"Text" column does not exist')

In [13]:
data = {'Text': ['Hello', 'World', 'Python', 'Pandas']}
df2 = pd.DataFrame(data)

In [14]:
len_character(df2)

     Text  character_count
0   Hello                5
1   World                5
2  Python                6
3  Pandas                6

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size returns the total number of elements in the DataFrame, which is equal to the product of the number of rows and the number of columns.
It returns a single integer value representing the size of the DataFrame.
The value is calculated as number of rows * number of columns.

DataFrame.size gives you the total number of elements in the DataFrame.
DataFrame.shape gives you a tuple with the number of rows and columns in the DataFrame.

Q6. Which function of pandas do we use to read an excel file?

In [15]:
# we use read_excel()
#eg., df = pd.read_excel('file path') for 'xls or xlsx' files

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [55]:
def username_extraxt(email):
    return email.split('@')[0]

In [56]:
data = {'email':['user1@gmail.com','user2@gmail.com','user3@outlook.com']}
df3 = pd.DataFrame(data)

In [57]:
df3

               email
0    user1@gmail.com
1    user2@gmail.com
2  user3@outlook.com

In [58]:
df3['username'] = df3['email'].apply(username_extraxt)

In [59]:
df3

               email username
0    user1@gmail.com    user1
1    user2@gmail.com    user2
2  user3@outlook.com    user3

In [60]:
def domain_name_extraxt(email):
    return email.split('@')[1]

In [61]:
df3['domain_name'] = df3['email'].apply(domain_name_extraxt)

In [62]:
df3

               email username  domain_name
0    user1@gmail.com    user1    gmail.com
1    user2@gmail.com    user2    gmail.com
2  user3@outlook.com    user3  outlook.com

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [63]:
data2 = pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

In [64]:
data2

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [66]:
def data2_condition(data2):
    
    return data2[(data2['A']>5) & (data2['B']<10)]

In [67]:
data2_condition(data2)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [68]:
def central_tendencies(df):
    
    mean = df['Values'].mean()
    
    meadian = df['Values'].median()
    
    std_dev = df['Values'].std()
    
    return mean, median, std_dev

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [69]:
def calculate_moving_average(df, window_size =7):
    
    df['Date'] = pd.to_datetime(df['Date'])
    
    df.set_index('Date', inplace = True)
    
    df['Moving_avg'] = df['Sales'].rolling(window = window_size, min_periods=1).mean()
    
    return df

In [70]:
data = {'Date': ['2023-09-01', '2023-09-02', '2023-09-03', '2023-09-04', '2023-09-05', '2023-09-06', '2023-09-07', '2023-09-08', '2023-09-09', '2023-09-10'],
        'Sales': [100, 120, 130, 110, 90, 95, 105, 115, 125, 140]}

In [71]:
df = pd.DataFrame(data)

In [73]:
calculate_moving_average(df)

            Sales  Moving_avg
Date
2023-09-01    100  100.000000
2023-09-02    120  110.000000
2023-09-03    130  116.666667
2023-09-04    110  115.000000
2023-09-05     90  110.000000
2023-09-06     95  107.500000
2023-09-07    105  107.142857
2023-09-08    115  109.285714
2023-09-09    125  110.000000
2023-09-10    140  111.428571

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [74]:
def weekday_column(df):
    
    df['Date'] = pd.to_datetime(df['Date'])
    
    df['weekday'] = df['Date'].dt.strftime('%A')
    
    return df

In [75]:
data3 = {'Date': ['2023-09-01', '2023-09-02', '2023-09-03', '2023-09-04', '2023-09-05']}
df3 = pd.DataFrame(data3)

In [76]:
weekday_column(df3)

        Date   weekday
0 2023-09-01    Friday
1 2023-09-02  Saturday
2 2023-09-03    Sunday
3 2023-09-04    Monday
4 2023-09-05   Tuesday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [83]:
def timestamp(df, start_date, end_date):
    
    df['Date'] = pd.to_datetime(df['Date'])
    
    selected_rows = df[(df['Date']>= start_date) & (df['Date']<=end_date)]
    
    return selected_rows

In [84]:
data4 = {'Date': ['2023-01-05', '2023-01-15', '2023-02-05', '2023-01-25', '2023-03-01']}
df4 = pd.DataFrame(data)

In [85]:
start_date = pd.to_datetime('2023-01-01')
end_date = pd.to_datetime('2023-01-31')
result_df = timestamp(df4, start_date, end_date)

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [87]:
import pandas as pd
# this the foremost library that needed to import for analysis.